Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: ཡོངས་སུ་བསྐྱང་བར་བགྱི།
en: I will protect them.

source: གནོད་པ་ལས་བཟློག་པར་བགྱི།
en: I will turn away all harm.

source: དོན་དང་དགེ་བ་ལ་གཟུད་པར་བགྱིའོ།
en: I will lead them to virtue and what is meaningful.

source: །གང་དག་བདུད་ཀྱི་ཚོགས་ཀྱིས་མི་ཐུབ་པའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐ་ན་བྲིས་ནས། འཆང་བ་རྣམས་དང་། གང་ན་ཆོས་སྨྲ་བའི་སེང་གེའི་ཁྲི་ལ་མཆིས་ཏེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་དག་པར་རབ་ཏུ་འཆད་པར་འཚལ་བ། དེ་དག་གིས་དེར་ཐོག་མར་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་བརྗོད་པར་བགྱིའོ། །གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་གིས་བདག་འགུགས་པར་འགྱུར་ཏེ།
en: “Wherever the Dharma discourse of this dhāraṇī, which cannot be defeated by the hosts of Māra , is at least written down, or where there is a lion throne set for Dharma teachers who desire to teach it authentically, people should recite the following mantra at the outset.

source: བདག་ཉིད་འཁོར་དང་བཅས་པ་ཕྱོགས་དེར་མཆིས་ནས།
en: This mantra will summon me, and I will come to that place with my retinue.

source: ཆོས་སྨྲ་བ་དེ་དག་དང་། ཆོས་ཉན་པ་དེ་དག་བསྲུང་བ་དང་། སྦ་བར་བགྱིའོ། །འདི་ལྟ་སྟེ། ཨ་བ་མེ། ཨ་བ་མེ།
en: We will defend and safeguard those Dharma teachers and students.

source: ཨ་མ་བ་རེ།
en: The mantra is:

source: ཨ་མ་བ་རེ། པ་རི་ཀུཉྫ། ནཱ་ཌ་ནཱ་ཌ་པུཥྐ་ར་མ་ཧཱ། ཛ་ལུ་ཁ། མ་ཁ་ཡ། ཨི་ལི་མི་ལི།
en: avame avame amavare amavare parikuñja nāḍa nāḍa puśkaravahā jalukha makhaya ili mili kili mili kīrticara mudre mudra­mukhe svāhā

source: ཀི་ལི་མི་ལི། ཀཱིརྟི་ཙ་ར་མུ་དྲེ། མུ་དྲ་མུ་ཁེ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་གང་དང་གང་ན་ཆོས་སྨྲ་བ་དེ་དག་གིས་ཐོག་མར་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་དྲན་པར་བགྱིས་ལ།
en: “Blessed One, Dharma teachers everywhere should remember this mantra at the start of their teachings.

source: བདག་གིས་ཀྱང་ལྷའི་རྣ་བའི་ཁམས་ཤིན་ཏུ་ཡོངས་སུ་དག་པས་ཐོས་ཏེ་དེར་མ་མཆིས་ན། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་བསླུས་པར་འགྱུར་ཞིང་། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་མི་འགྱུར་བས།
en: If I hear them with my divine ears of incredible purity and fail to come, I will have deceived all the thus-gone ones of the past, present, and future, and may I therefore not fully awaken to unsurpassed and perfect buddhahood.

source: བཅོམ་ལྡན་འདས་བདག་དེར་མཆིས་ལ་ཆོས་སྨྲ་བའི་རྐང་པའི་དྲུང་དུ་སྤྱི་བོས་བླང་བར་བགྱིའོ།
en: Therefore, Blessed One, I will go there and place the feet of those Dharma teachers at the crown of my head.

source: །ཆོས་སྨྲ་བ་དེའི་སྤོབས་པ་རིགས་པས་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ། །ཆོས་སྨྲ་བ་དང་ཆོས་ཉན་པ་དེ་དག་གི་ནད་ཐམས་ཅད་བསལ་བར་བགྱི།
en: Because the eloquence of those Dharma teachers is fitting, I will support them. I will dispel all the sicknesses of those Dharma teachers and students.

source: ལྟ་བ་ངན་པ་དང་། བྱ་བ་ངན་པ་དང་། ཐེ་ཙོམ་ཐམས་ཅད་བསལ་བར་བགྱི།
en: I will dispel their bad views and actions and all their doubts.

source: བཅོམ་ལྡན་འདས་ཕྱོགས་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བ་དང་། འཛིན་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དེར་བ་དག་འཁོར་དང་བཅས་ཏེ་མཆིས་ནས་འཐབ་པ་དང་། རྩོད་པ་དང་། མུ་གེ་དང་། ནད་དང་། འཇིགས་པ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། ཆར་མི་འབབ་པ་དང་། དུས་མ་ལགས་པའི་རླུང་དང་། ཚ་བ་དང་། ལྟ་བ་ངན་པ་དང་། བྱ་བ་ངན་པ་དེ་དག་ཐམས་ཅད་དང་། མི་དང་མི་མ་ལགས་པ་དང་། དུར་ཁྲོད་རྣམས་ཀྱི་འཇིགས་པ་ཐམས་ཅད་ཞི་བར་བགྱིའོ།
en: Blessed One, wherever this Dharma teaching is taught, upheld, or mastered, I will travel there with my retinue and quell all discord, quarrels, famine, disease, fears, invasion by foreign powers, drought, unseasonable winds, heatwaves, and bad views and actions, as well as all fear of humans, nonhumans, and charnel grounds.

source: །དེ་ནས་བཀྲ་མི་ཤིས་པ་དང་། རྨི་ལམ་ངན་པ་དང་། ལྟས་ངན་པ་དང་། སྡང་བ་དང་། བརླང་བ་དང་། ཞེ་གཅོད་པ་དང་། རོ་བྲོ་བ་མ་མཆིས་པ་དང་། ཁ་བ་དང་། ཚ་བ་དང་། དྲི་ང་བ་དང་། རེག་ན་མི་བདེ་བའི་དུག་དེ་དག་ཐམས་ཅད་བསལ་བར་བགྱིའོ།
en: Then I will dispel all that is inauspicious, bad dreams, evil omens, hostility, cruelty, meanness, bad tastes, snow, heat, foul odors, and things that are unpleasant to touch and poisonous.

source: །དེར་ཚ་བ་དང་མུ་གེའི་གནོད་པ་རྣམས་བསལ་བར་བགྱིའོ།
en: I will dispel the harm caused by heat and famine.

source: །གླང་པོ་ཆེ་དང་། སེང་གེ་དང་། སྟག་དང་། མ་ཧེ་དང་། སྤྱང་ཀི་དང་། སྦྲུལ་གདུག་པ་དང་། རྐུན་པོ་དང་། གཡོན་ཅན་དང་། མི་དང་མི་མ་ལགས་པའི་འཇིགས་པ་ཐམས་ཅད་བསལ་བར་བགྱིའོ།
en: I will dispel the fear of elephants, lions, tigers, buffaloes, wolves, poisonous snakes, thieves, rogues, humans, and nonhumans.

source: །དེར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལོངས་སྤྱོད་དང་། ཀུན་ཏུ་སྤྱོད་པའི་སླད་དུ་ནོར་དང་། འབྲུ་དང་། སྨན་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། རོ་དང་ཟས་དང་། སྐོམ་དང་། གོས་དང་། མལ་ཆ་སྣ་ཚོགས་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ།
en: There I will amass all sorts of wealth, grain, herbs, flowers, fruits, juices, food, drink, clothing, and bedding for the beings’ use and enjoyment.

source: །ཡུལ་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། འཆད་པ་དེར་བདག་ཅག་གིས་སེམས་ཅན་རྣམས་ཀྱི་གནོད་པ་ཐམས་ཅད་སོ་སོར་བསལ་བར་བགྱིའོ།
en: In whatever land this Dharma teaching is held, upheld, read, mastered, or taught, there we will dispel violence toward each individual being.

source: །སེམས་ཅན་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཀུན་སྤྱོད་པའི་སླད་དུ་ཕན་པ་དང་། བདེ་བ་དང་། ཡིད་བདེ་བ་ཐམས་ཅད་བསྒྲུབ་པར་བགྱིའོ། །སེམས་ཅན་དེ་དག་ཀྱང་ཆོས་འདོད་པ་དང་། དགེ་བ་སྤྱོད་པ་ལ་གཟུད་པར་བགྱི་སྟེ།
en: I will bring about what is beneficial, pleasant, and mentally satisfying for the beings’ use and enjoyment. I will encourage beings to also desire the Dharma and engage in virtuous actions.

source: འདི་ནི་བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར་སྨོན་ལམ་བཏབ་པའོ།
en: I make these aspirations before all the blessed buddhas!

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་བདག་ལ་ཐུགས་བརྩེ་བར་མཛད་དུ་གསོལ།
en: All of you blessed buddhas, please be compassionate toward me!

source: སྐྱེས་བུའི་མཐུ་འདི་ཉམས་འོག་ཏུ་ཆུད་པར་བགྱི་བའི་སླད་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བདག་ལ་ཡིད་བཞིན་དུ་བསམ་པ་ཡོངས་སུ་རྫོགས་པའི་ལས་ཀྱི་དངོས་གྲུབ་སྩལ་དུ་གསོལ།
en: May the blessed buddhas bestow the mastery that functions to fulfill all that one wishes for in order to realize this power.”

source: དེ་ནས་དེའི་ཚེ་དེའི་མོད་ལ་ཤཱཀྱ་ཐུབ་པ་ལ་སོགས་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་ཚངས་པ་དབྱངས་དང་ལྡན་པ་དེ་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཚངས་པ་དབྱངས་དང་ལྡན་པ་འདིས་གང་གི་ཕྱིར། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་དང་། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ལ་མངོན་པར་དགའ་བའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་རྣམས་བཀུག་སྟེ། སྐྱེས་བུའི་མཐུ་ཆེན་པོ་འདི་ལྟ་བུ་བྱེད་པར་འགྱུར་གྱིས།
en: At that moment, Śākyamuni and all the blessed buddhas directed their compassion to Voice of Mahābrahmā and said, “Voice of Mahābrahmā, because of this aspiration you shall obtain the great power to summon śakras, brahmās, all the world protectors, and the other gods, nāgas, yakṣas, gandharvas, and asuras who appreciate the Dharma.

source: ངེད་ཀྱིས་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་ཚངས་པ་དབྱངས་དང་ལྡན་པ་འདི་ལ་སྦྱིན་པར་བྱའོ།
en: We shall give this mantra to Voice of Mahābrahmā.”

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཚངས་པ་དབྱངས་དང་ལྡན་པ་ལ་གྲུབ་པར་གྱུར་ཅིག །འདི་ལྟ་སྟེ། ཙ་མུཎ་ཌེ།
en: Then the blessed buddhas made the aspiration, “May accomplishment come to Voice of Mahābrahmā.

source: མུཎ་ཌ་པ་རི་ཚེ་དེ། ཧ་མཱུ་ཧ།
en: The mantra is:

source: ཧ་མཱུ་ཧ། སཾརཀྵ་བ་ལ། ཀྲཱིཥྞ་མི་ཁ། པ་རི་བ་ཧ། ཙ་མ་ར་ཡ་ཐ་ཙ།
en: camuṇḍe muṇḍa­parichede ha mūha ha mūha saṃra­kṣavala kṛṣṇa­mikha parivaha camarayatha ca suvikha amuhula parichede sarva­buddhādhiṣṭhite svāhā

source: སུ་བི་ཁ། ཨ་མུ་ཧུ་ལ་པ་རི་ཚེ་དེ། སརྦ་བུད་དྷ་ཨ་དྷིཥྛི་ཏེ་སྭ་ཧཱ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་བདུད་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་དང་། གཞན་ཡང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་རྣམས་དང་། གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བའི་མི་དང་། མི་མ་ཡིན་པ་རྣམས་དགུག་ཅིང་འདུན་པར་བྱེད་པའི་གཟུངས་འདི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་ཞིང་།
en: The thus-gone Śākyamuni said, “Noble son, this dhāraṇī can summon and inspire all māras, śakras, brahmās, and world protectors, as well as the other gods, nāgas, yakṣas, gandharvas, asuras, and human and nonhuman beings of great splendor. It is upheld and blessed by all the buddhas.

source: བྱིན་གྱིས་བརླབས་ཀྱིས་ཁྱོད་འདི་སྐྱེས་བུའི་མཐུ་ཆེན་པོ་འདི་ལྟ་བུ་བྱེད་ནུས་པར་འགྱུར་རོ།
en: Due to its blessings you will be able to master such great powers.”

source: །དབྱངས་དང་ལྡན་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་བུད་མེད་ཀྱི་ཆ་བྱད་འདི་ལྟ་བུས་ཆོས་ཀྱི་ཚུལ་བསྲུང་བར་བགྱིའོ།
en: “Blessed One,” replied Voice of Mahābrahmā, “I will guard this Dharma method in the guise of a woman.

source: །བུད་མེད་རྣམས་ཀྱང་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: I will also protect women.

source: །བཅོམ་ལྡན་འདས་བུད་མེད་ལ་ལ་ཞིག་བུ་འཚལ་ཏེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་ཏམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བགྱིད་དམ། བྲིས་ཏེ་འཆང་ན་བདག་གིས་བུད་མེད་དེའི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ།
en: Blessed One, should a woman desire sons, I will fulfill her wishes if she upholds this Dharma teaching by keeping it, reading it, mastering it, or writing it down.

source: །ཡང་བུད་མེད་གང་འདི་ལྟ་བུས་སེམས་ཡོངས་སུ་སྐྱོང་བར་གྱུར་ཏེ།
en: In that way any woman can be protected, for if she holds, reads, . . .

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་ཞིང་ཀློག་པ་ནས་ཉན་པའི་བར་དུ་བགྱིད་ན། དེ་འདོད་པ་ན་སྤྱོད་ཀྱང་དེ་མངལ་དུ་མི་ཆགས་སོ།
en: or listens to this Dharma teaching then, even if she experiences desire, she will not be attached to the womb.

source: །ཡང་བུད་མེད་གང་བརྙས་ཤིང་སྨད་པར་གྱུར་པའི་ལོངས་སྤྱོད་དང་། ཀུན་སྤྱོད་པ་དང་བྲལ་བ་དེས། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀླགས་ན་བསམ་པ་ཐམས་ཅད་འགྲུབ་ཅིང་། བདེ་བ་ཐམས་ཅད་ཀྱང་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ།
en: When a woman who is free from all negative and apprehensive conduct and behavior reads this Dharma teaching, all her wishes will be fulfilled, and she will be filled with all forms of abundant happiness.

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྲུང་བ་དང་། སེམས་ཅན་གྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་སླད་དུ། བདག་གིས་ནོར་བུ་རིན་པོ་ཆེ་འདི་གཉིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་དབུལ་ལོ།
en: I offer these two precious gems to all the blessed buddhas in order to guard this Dharma teaching and fulfill the wishes of all.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: “Noble son, thus it is,” responded the Blessed One.

source: བསྲུང་བ་དང་། ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: “You will thus guard and protect it.”

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། གཟུངས་ཀྱི་ལེའུ་སྟེ་དྲུག་པའོ།།
en: This concludes the chapter on the dhāraṇīs, the sixth in the “ Ratnaketu ” section of the Great Collection.

source: །།བམ་པོ་བདུན་པ།
en: Chapter

source: ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་བློ་གྲོས་ཞེས་བྱ་བ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དང་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ནོར་བུ་འོད་འབར་བ་དཔལ་གྱི་སྤྱན་སྔར་འདུག་ནས།
en: At that time, a bodhisattva great being called Discriminating Intellect was seated before the blessed, thus-gone Glorious and Brilliantly Shining Jewel, not far from the blessed, thus-gone Śākyamuni.

source: དེ་ཡུད་ཙམ་གྱིས་ཚངས་པའི་ཆ་བྱད་དང་། སྐད་ཅིག་གིས་བདུད་ཀྱི་གཟུགས་སུ་སྣང་ངོ་།
en: For a short time he was in the guise of Brahmā , before instantaneously appearing in the form of Māra

source: །དེ་བཞིན་དུ་སྦྱར་ཏེ། བརྒྱ་བྱིན་གྱི་གཟུགས་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་དབང་པོའི་གཟུགས་དང་། འཕྲུལ་དགའ་དང་། དགའ་ལྡན་དང་། འཐབ་བྲལ་དང་། རྒྱལ་ཆེན་བཞི་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དང་། རྒྱལ་རིགས་དང་། བྲམ་ཟེའི་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། སེང་གེ་དང་། གླང་པོ་ཆེ་དང་། མ་ཧེ་ནས་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་བར་གྱི་གཟུགས་རྣམ་པ་སྣ་ཚོགས་སུ་སྣང་ངོ་།
en: He likewise briefly appeared in the forms of Śakra, as well as a lord of the gods in the heavens of Making Use of Others’ Emanations, Delighting in Emanations, Tuṣita, Free from Strife, and the Four Great Kings, as well as in the form of Maheśvara, and also as a yakṣa, an asura, a garuḍa, a kinnara, a mahoraga, a rākṣasa, a preta, a piśāca, a kumbhāṇḍa, a kṣatriya, a brahmin, a vaiśya, a śūdra, a lion, an elephant, a buffalo, and myriad other species of the animal realm.

source: །སྐད་ཅིག་གིས་བྱ་དང་། ཤིང་དང་། རི་དང་། འབྲས་བུ་དང་། གོས་དང་། མལ་ཆ་དང་། སྣམ་བུ་དང་། སྣོད་དང་། ཕྱང་འཕྲུལ་དང་། རྒྱན་དང་། སྨན་རྣམ་པ་སྣ་ཚོགས་དང་། རིན་པོ་ཆེའི་གཟུགས་དང་། ཡུད་ཙམ་གྱིས་དགེ་སློང་དང་། དགེ་སློང་མའི་གཟུགས་དང་། སྐད་ཅིག་གིས་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་སྣང་ངོ་།
en: Instantaneously he appeared in the form of a bird, a tree, a mountain, fruit, clothing, bedding, heavy cloth, a vase, ornaments, jewelry, medicinal herbs, and a jewel. Instantaneously he also appeared in the form of a monk, a nun, and a buddha.

source: །སྐད་ཅིག་གིས་ཁ་དོག་དང་། རྟགས་དང་། དབྱིབས་དང་། གཟུགས་བརྒྱད་ཅུ་རྩ་བཞིར་སྣང་ངོ་།
en: Instantaneously he appeared in eighty-four different colors, characteristics, shapes, and forms.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འདི་ཁ་དོག་དང་། རྟགས་དང་། དབྱིབས་དང་། གཟུགས་བརྒྱད་ཅུ་རྩ་བཞིར་གདའ་བའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: Then Pūrṇa, the son of Maitrāyaṇī, asked the thus-gone Śākyamuni, “Blessed One, what is the cause and what are the conditions of this noble son shifting his appearance among eighty-four different colors, characteristics, shapes, and forms?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཚེ་དང་ལྡན་པ་གང་པོ་རིགས་ཀྱི་བུ་འདི་རབ་ཏུ་མཐུ་ཆེ་སྟེ།
en: “Venerable Pūrṇa, this noble son has incredibly great power,” responded the Blessed One.

source: བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་བློ་གྲོས་དམ་བཅས་པའི་སྟོབས་ཀྱི་ཡུལ་གང་ལ་གནས་ནས། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་།
en: “The bodhisattva great being Discriminating Intellect matures beings while abiding by the power of his pledge.

source: ཤེས་རབ་ཀྱི་མིག་སྒྲིབ་པ་མེད་པས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་མ་དག་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ན་བསམ་པ་དང་། སེམས་པ་ཇི་ལྟ་བུ་དང་། སྤྱོད་པ་ཇི་ལྟ་བུ་དང་། ཅི་འདྲ་བའི་ནད་ཀྱིས་བཏབ་པ་དང་། གང་ལ་གང་སྐྱབས་སུ་སོང་བའི་སེམས་ཅན་ཇི་འདྲ་བ་དག་མཐོང་བ་དེ་འདྲ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་བར་གྱི་གཟུགས་དང་། ཁ་དོག་དང་། རྟགས་དང་། སྤྱོད་ལམ་དང་། དབྱིབས་དང་། གཟུགས་དེ་ལྟ་བུ་དག་གིས་སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་འགོད་པ་དང་། སེམས་ཅན་གང་དག་འདོད་པའི་ཟིལ་གྱིས་ནོན་ཏེ་ཡོ་བྱད་དང་ལོངས་སྤྱོད་རྣམ་པ་སྣ་ཚོགས་པ་འདོད་པ་དེ་དག་གི་ཆགས་པ་སྤང་བའི་ཕྱིར་ཡོ་བྱད་རྣམས་བྱིན་ནས་ཕྱིར་མི་ལྡོག་པ་ལ་འགོད་པ་དང་། ནད་ཀྱིས་བཏབ་ནས་སྨན་འདོད་པ་རྣམས་ལ་སྨན་སྦྱིན་ཏེ།
en: With the unobscured eyes of insight, in countless infinite buddha fields throughout the ten directions, both pure and impure, he can see beings and their kinds of thoughts, intentions, actions, and illnesses and where they go for refuge. Abiding in this type of absorption, he adopted forms ranging from bodhisattvas to buddhas as well as colors, characteristics, actions, shapes, and forms as was necessary to guide beings and establish them at the point where they will not revert from the three vehicles. To ensure that beings who are overwhelmed by their desire, hankering after all kinds of possessions and enjoyments, could eliminate their attachment, he gave them possessions and established them at the point of irreversibility. He distributed medicine to those who were afflicted with illness and desired a cure, and he established them at the point of irreversibility.

source: ཕྱིར་མི་ལྡོག་པ་ལ་འགོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་བློ་གྲོས་འདིས་ཉིན་གཅིག་ལ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ཏེ།
en: The bodhisattva Discriminating Intellect freed beings as numerous as the grains of sand in the Gaṅgā in a single day.

source: ཐེག་པ་གསུམ་ལ་ཕྱིར་མི་ལྡོག་པར་འགོད་པའི་དམ་བཅས་པའི་སྟོབས་ཀྱི་ཡུལ་འདི་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ས་མ་ཡིན།
en: This power of his pledge to establish them at the point where they will not revert from the three vehicles is not the domain of the hearers or solitary buddhas.

source: བགྲོད་པ་མ་ཡིན་ནོ།
en: They do not reach this far.”

source: །གང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འདིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ། སྐྱེས་བུ་ཆེན་པོའི་མཐུ་ཆེན་པོ་བརྩམས་ནས་ཅི་སྲིད་ཅིག་ལགས།
en: “Blessed One, how long has this noble son exercised this great power for the sake of bringing beings to maturity?” asked Pūrṇa.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་འདིས་བསྐལ་པ་གང་དག་གི་ཕ་རོལ་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་བསྐལ་པ་ནི་གྲངས་མེད་དེ།
en: “This noble son developed the mind directed toward unsurpassed and perfect awakening in the furthest reaches of eons past,” answered the Blessed One.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དོ།
en: “It was countless eons ago—as many as there are particles of dust in all the buddha fields.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་བློ་གྲོས་འདིས་བསྐལ་པ་གང་དག་ལ་ཏིང་ངེ་འཛིན་གྱི་མཐུས་སྐྱེས་བུའི་མཐུ་འདི་ལྟ་བུ་བརྩམས་ནས་བསྐལ་པ་གྲངས་མེད་པ་དྲུག་ཅུ་རྩ་བཞི་འདས་སོ། །གང་པོས་གསོལ་པ།
en: By now, sixty-four immeasurable eons have passed since the eon when that bodhisattva Discriminating Intellect began exercising this power by means of the strength of his absorption.”

source: འདི་ཇི་སྲིད་ཅིག་ན་སངས་རྒྱས་ཀྱི་ཞིང་གང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: “How long will it be until he fully awakens to unsurpassed and perfect buddhahood?” Pūrṇa asked.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བསྐལ་པ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་དྲུག་འདས་པའི་འོག་ཏུ་བསྐལ་པ་ཆེན་པོ་སྒྲོལ་བ་ཞེས་བྱ་བ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་ནོར་བུའི་སྙིང་པོ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: The Blessed One answered, “After two million six hundred thousand great eons have passed, in a great eon called Liberation, there will be a buddha field called Heart of the Jewel.

source: སྐྱེ་དགུའི་ཚེ་ལོ་སྟོང་ཕྲག་བཞི་བཅུ་ཐུབ་པ་ན་མཚམས་མེད་པ་བྱེད་པ་ནས།
en: There the lifespan of beings will be forty thousand years.

source: མི་དགེ་བ་བཅུའི་ཆོས་ཀྱི་བར་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ཀྱི་ནང་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: He will fully awaken to unsurpassed and perfect buddhahood among beings who are inclined toward acts ranging from those of immediate retribution up until the ten nonvirtuous actions.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་རྒྱས་པ་མཐའ་ཡས་པའི་འོད་ཟེར་ཞེས་བྱ་བར་འགྱུར་རོ།
en: He will be known as the thus-gone, worthy, perfect buddha Light of the Limitlessly Blossoming Flower.

source: །དེས་ལོ་བཞི་ཁྲིར་སངས་རྒྱས་ཀྱི་བྱ་བ་མ་ལུས་པར་བྱེད་པར་འགྱུར་རོ།
en: He will perform all the deeds of a buddha without exception for forty thousand years.

source: །ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་ཐེག་པ་གསུམ་པོ་དག་ལ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: He will mature beings in the three vehicles so that they may reach parinirvāṇa, following which he himself will enter parinirvāṇa in the expanse of nirvāṇa without the remainder of the aggregates.”

source: །གང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་སྐྱེས་བུ་དམ་པ་འདིས་སྔོན་སེམས་ཅན་གང་དག་ཡོངས་སུ་སྨིན་པར་བགྱིས་པ་དེ་དག་གང་དུ་འབྱུང་བར་འགྱུར།
en: Pūrṇa then asked, “From where do this sublime being’s deeds that mature beings manifest?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐྱེས་བུ་ཆེན་པོ་དེའི་སྨོན་ལམ་རིས་སུ་ཆད་པ་མེད་དེ།
en: “This great being’s aspirations are without bias,” answered the Blessed One.

source: དེས་སྨོན་ལམ་འདི་སྐད་དུ།
en: “He made this aspiration:

source: ནམ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ།
en: ‘The blessed buddhas clearly see as many buddha fields as there are particles of dust in all the buddha fields in each of the ten directions.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བར་ཆད་མེད་པར་མཐོང་བར་མ་གྱུར་ཏམ། བདག་གིས་སྔོན་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན། སེམས་ཅན་གང་དག་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཙུད་པ་དང་། ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བཀོད་པ་དེ་དག་ཕྱོགས་བཅུར་སོ་སོར་སངས་རྒྱས་ཀྱི་ཞིང་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་མ་མཐོང་བ་དེ་སྲིད་དུ། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བྱའོ།
en: Therefore, I too will not fully awaken to unsurpassed and perfect buddhahood until I see those beings that I, while I previously practiced awakened conduct, caused to initially arouse the mind set on unsurpassed and perfect awakening, take hold of it, practice the six perfections, and fully awaken to unsurpassed and perfect buddhahood in buddha fields in each of the ten directions.

source: །ཏིང་ངེ་འཛིན་བཀོད་པའི་མཐུ་འདི་འདྲ་བས་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི། སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་དང་གཞན་དག་ན་ཡང་། སེམས་ཅན་གང་དག་མཚམས་མེད་པ་བྱེད་པ་དང་། ཐེ་ཚོམ་ཅན་ནས་མི་དགེ་བའི་ཆོས་ཀྱི་བར་དང་ལྡན་པར་གྱུར་པ་དེ་རྣམས་དེ་དག་ནས་ཤི་འཕོས་ནས། བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེས་ལ།
en: Through this type of power, based on absorption, may all beings in all buddha fields—as many as there are atoms in all the buddha fields in each of the ten directions—and in any other realm who are inclined toward acts ranging from those of immediate retribution and doubt up until the ten nonvirtuous actions, be reborn in my buddha field after they pass away.

source: བདག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་བཞིན་དུ། དེ་དག་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བྱ་སྟེ། ཕྱིར་མི་ལྡོག་པ་ལ་སོ་སོར་བཀོད་ནས། དེ་ནས་གདོད་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་སྐྱེས་བུའི་མཐུ་ཆེན་པོ་འདི་ལྟ་བུ་རྒྱུན་དུ་བྱའོ་ཞེས་སྨོན་ལམ་བཏབ་བོ།
en: Then, may I always use this great power to manifest as a bodhisattva in order to arouse roots of virtue in these beings, establish each of them at the level of irreversibility, and ensure that they fully awaken to unsurpassed and perfect buddhahood.’ ”

source: །དེ་ནས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གང་དག་ད་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་ལྷགས་པ་རྣམས་སྟོན་པ་འདི་ལྟ་བུ་དག་ཀྱང་མཉེས་པར་བགྱིས། བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་འདུས་པ་ཆེན་པོ་འདི་ལྟ་བུ་ཡང་མཐོང་།
en: Then the bodhisattvas who had congregated from buddha fields in the ten directions said, “Those bodhisattvas who have come to this buddha field have gladdened such teachers.

source: འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བགྱི་བའི་གཟུངས་ཕྱག་རྒྱ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པའི་ཆོས་ཀྱི་ཚུལ་གྱི་བྱིན་གྱི་རླབས་སྔོན་མ་ཐོས་པ་འདི་ཡང་ཆོས་མཉན་པའི་སླད་དུ།
en: Seeing this great assembly of bodhisattvas endowed with great compassion, we have received an excellent and unprecedented opportunity to receive the blessings of the blessed buddhas of the past, present, and future. Thus, we received this Dharma method, this exposition of the dhāraṇī-seal, including its verbal formula, which is called the terminator of birth based on the essential nature of phenomena in their vajra-like indivisibility

source: རྙེད་པ་ནི་བདག་ཅག་གིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ།
en: How fortunate we are!”

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ལེའུ་སྟེ། བདུན་པའོ།།
en: This concludes the chapter on upholding the sacred Dharma, the seventh in the “ Ratnaketu ” section of the Great Collection.

source: །།ཡང་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པས།
en: Chapter

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་བོས་ཏེ། འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: At that time, the thus-gone Akṣobhya addressed the entire assembly:

source: །རིགས་ཀྱི་བུ་དག་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་ནས་མི་དང་མི་མ་ཡིན་པའི་བར་དུ་གང་དག་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་དད་པ་འདིར་ལྷགས་པ་ཁྱེད་ཅག་ཐམས་ཅད་ངས་སྤྲོ་བར་བྱའོ།
en: “Noble children, all of you śakras, brahmās, world protectors, and lords of the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and so forth, as well as human and nonhuman beings, who have arrived here out of faith in the buddhas’ teaching—I will uplift you!
